//******************************************************************************************************************
//**                                             FIRST C Programm 11.04.2014                                      **
//**                           Программа для чтения значений АЦП и отправка результата по UART                    **
//**                                                    (с) Alche™                                                **                        **
//******************************************************************************************************************
// GPIO,0 - вход АЦП
// GPIO,2 - выход TX UART скорость порта = 2400

unsigned int temp_res;
void main() {
  CMCON =  0b00000111;                                   //Значение для конфигурации компаратора (отключаем)
  ANSEL        =  0b00010011;                            //Слово конфигурации для ANSEL, FOsc/2 GP0 аналоговый вход
  TRISIO = 0b00000001;                                   //GP0 вход, остальные выходы
  ADCON0 = 0b10000001;                                   //Слово конфигурации для ADCON
  Soft_UART_Init(&GPIO, 1 , 2, 2400, 0);                 //Инициализация UART
  do {
    temp_res = ADC_Read(0);                              // Получим 10ти битный результат АЦП
    Soft_UART_Write(temp_res>>8);                        // Отправим старшие байты по UART
    Delay_ms(100);                                       // Задержка 100мс
    Soft_UART_Write(temp_res);                           // Отправим младший байт
  } while(1);                                            // Зациклимся
}